[
  {
    "date_interval": "September 2023 - ",
    "title": "Backend Developer (Vaimo)",
    "description": "As a Backend/Support Engineer, I collaborated to ensure reliable e-commerce platforms, using Grafana and K9s for monitoring. I managed deployments with Jenkins and Docker, incorporating testing pipelines. I provided platform and backend support, tracking tickets in Jira. I automated recurring tasks with Python. My focus was on team collaboration and maintaining a stable platform.",
    "link": "https://www.vaimo.com",
    "type": "work"
  },
  {
    "date_interval": "October 2022 - September 2023",
    "title": "Full Stack Engineer (Sci-Bono Discovery Centre)",
    "description": "Work integrated Learning, Designed and developed comprehensive web and mobile application solutions, encompassing both front-end and back-end development. Created interactive user interfaces with React and Bootstrap, and built robust back-end systems using PHP, MySQL, Laravel, and Django. Developed detailed application mockups, ensuring seamless user experiences and efficient database management.",
    "link": "#",
    "type": "work"
  },
  {
    "date_interval": "May 2022 - December 2022",
    "title": "Google IT Support Professional Certificate (Coursera)",
    "description": "Completed the Google IT Support Professional Certificate, building a strong foundation in core IT support principles. Developed practical skills in troubleshooting, customer service, network administration, operating systems, system administration, and security. Demonstrated proficiency through hands-on assessments, gaining experience in real-world IT support scenarios.",
    "link": "https://www.credly.com/badges/7b8af752-a683-4ab5-a556-52f03d60648e/public_url",
    "type": "education"
  },
  {
    "date_interval": "December 2022 - May 2023",
    "title": "Google IT Automation with Python Professional Certificate (Coursera)",
    "description": "Completed the Google IT Automation with Python Professional Certificate, gaining expertise in IT support, troubleshooting, and system administration. Developed proficiency in Python for automation, including cloud automation with Google Cloud Platform, configuration management with Puppet, network administration, operating systems, and security practices. Applied practical skills through hands-on assessments and projects, demonstrating the ability to automate routine tasks and improve system efficiency.",
    "link": "https://www.credly.com/badges/5b7b8c9c-2a8b-4a93-af06-b63d1d9a1c67/public_url",
    "type": "education"
  },
  {
    "date_interval": "May 2023 - September 2023",
    "title": "Meta Back-End Developer (Coursera)",
    "description": "Developed a robust foundation in back-end engineering through the Meta Back-End Developer Certificate program on Coursera. Mastered Python and the Django framework, and gained practical experience with relational (SQL) and NoSQL databases. Designed and implemented a fully functional e-commerce platform API, showcasing expertise in RESTful API design, user authentication, and efficient data modeling. Achieved top-tier project performance, demonstrating a commitment to high-quality code and problem-solving. Eager to leverage these skills to contribute to impactful projects in a dynamic development environment.",
    "link": "https://www.credly.com/badges/8ae43192-eb9f-4f39-adac-88ea938fbf24/public_url",
    "type": "education"
  },
  {
    "date_interval": "May 2023 - September 2023",
    "title": "Mobile Development with React Native Certificate (MTN Business Academy)",
    "description": "Completed a comprehensive NQF Level 5 certificate program focused on full-stack mobile development using React Native. Gained proficiency in building cross-platform applications, integrating Firebase for backend services, and mastering core front-end design principles. Developed critical problem-solving, presentation, and mathematical skills essential for effective software development. Designed and submitted a final MVP demonstrating practical application of learned skills.",
    "link": "#",
    "type": "education"
  },
  {
    "date_interval": "June 2022 - December 2022",
    "title": "Forward Program Certificate (McKinsey)",
    "description": "Completed the McKinsey.org Forward Program, developing essential skills for the future of work. Mastered the McKinsey approach to problem-solving, enhancing analytical and strategic thinking. Improved communication and influence through structured frameworks, and cultivated adaptability and resilience for navigating dynamic environments. Developed a foundational digital toolkit, enabling efficient planning and execution. Demonstrated a commitment to continuous learning and professional development through completion of this rigorous program.",
    "link": "https://www.credly.com/badges/8c7853b7-3ce5-40d6-9df4-7cd9be4d90e8/public_url",
    "type": "education"
  },
  {
    "date_interval": "2017",
    "title": "Matriculation Certificate (National Senior Certificate) - Millennium Combined School",
    "description": "Completed National Senior Certificate (Matric) with a focus on Mathematics and Physical Science.",
    "link": "#",
    "type": "education"
  }
]
